### Create Pagila DB

In [13]:
!createdb -h 127.0.0.1 -U postgres pagila
!psql -q -h 127.0.0.1 -U postgres -d pagila -f data/pagila-schema.sql
!psql -q -h 127.0.0.1 -U postgres -d pagila -f data/pagila-data.sql

 set_config
------------

(1 row)

 set_config
------------

(1 row)

 setval
--------
    200
(1 row)

 setval
--------
    605
(1 row)

 setval
--------
     16
(1 row)

 setval
--------
    600
(1 row)

 setval
--------
    109
(1 row)

 setval
--------
    599
(1 row)

 setval
--------
   1000
(1 row)

 setval
--------
   4581
(1 row)

 setval
--------
      6
(1 row)

 setval
--------
  32098
(1 row)

 setval
--------
  16049
(1 row)

 setval
--------
   1500
(1 row)

 setval
--------
    500
(1 row)

### Connect to Pagila

In [14]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [15]:
DB_ENDPOINT = "127.0.0.1"
DB = 'pagila'
DB_USER = 'postgres'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}@{}:{}/{}".format(DB_USER, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)

postgresql://postgres@127.0.0.1:5432/pagila

In [16]:
%sql $conn_string

### Explore the 3NF Schema

<img src="./pagila-3nf.png" width="50%"/>

### Insight 1: Top Grossing Movies

Films

In [19]:
%%sql
select film_id, title, release_year, rental_rate, rating  from film limit 5;

 * postgresql://postgres@127.0.0.1:5432/pagila
5 rows affected.

[(1, 'ACADEMY DINOSAUR', 2012, Decimal('0.99'), 'PG'),
 (2, 'ACE GOLDFINGER', 2023, Decimal('4.99'), 'G'),
 (3, 'ADAPTATION HOLES', 2017, Decimal('2.99'), 'NC-17'),
 (4, 'AFFAIR PREJUDICE', 2023, Decimal('2.99'), 'G'),
 (5, 'AFRICAN EGG', 2019, Decimal('2.99'), 'G')]

Payments

In [20]:
%%sql
select * from payment limit 5;

 * postgresql://postgres@127.0.0.1:5432/pagila
5 rows affected.

[(16051, 269, 1, 98, Decimal('0.99'), datetime.datetime(2022, 1, 29, 4, 58, 52, 222594, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (16065, 274, 1, 147, Decimal('2.99'), datetime.datetime(2022, 1, 25, 15, 14, 16, 895377, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (16109, 297, 2, 143, Decimal('0.99'), datetime.datetime(2022, 1, 28, 3, 49, 49, 128218, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (16195, 344, 2, 157, Decimal('2.99'), datetime.datetime(2022, 1, 31, 8, 58, 51, 176578, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (16202, 348, 2, 821, Decimal('0.99'), datetime.datetime(2022, 1, 26, 19, 52, 41, 359433, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))))]

Inventory

In [21]:
%%sql
select * from inventory limit 5;

 * postgresql://postgres@127.0.0.1:5432/pagila
5 rows affected.

[(1, 1, 1, datetime.datetime(2022, 2, 15, 13, 9, 17, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (2, 1, 1, datetime.datetime(2022, 2, 15, 13, 9, 17, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (3, 1, 1, datetime.datetime(2022, 2, 15, 13, 9, 17, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (4, 1, 1, datetime.datetime(2022, 2, 15, 13, 9, 17, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800)))),
 (5, 1, 2, datetime.datetime(2022, 2, 15, 13, 9, 17, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))))]

Get the movie of every payment

In [22]:
%%sql
SELECT f.title, p.amount, p.payment_date, p.customer_id                                            
FROM payment p
JOIN rental r    ON ( p.rental_id = r.rental_id )
JOIN inventory i ON ( r.inventory_id = i.inventory_id )
JOIN film f ON ( i.film_id = f.film_id)
limit 5;

 * postgresql://postgres@127.0.0.1:5432/pagila
5 rows affected.

[('PACKER MADIGAN', Decimal('0.99'), datetime.datetime(2022, 1, 29, 4, 58, 52, 222594, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 269),
 ('CHARIOTS CONSPIRACY', Decimal('2.99'), datetime.datetime(2022, 1, 25, 15, 14, 16, 895377, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 274),
 ('CRAFT OUTFIELD', Decimal('0.99'), datetime.datetime(2022, 1, 28, 3, 49, 49, 128218, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 297),
 ('CRUSADE HONEY', Decimal('2.99'), datetime.datetime(2022, 1, 31, 8, 58, 51, 176578, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 344),
 ('ROMAN PUNK', Decimal('0.99'), datetime.datetime(2022, 1, 26, 19, 52, 41, 359433, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), 348)]

Sum movie rental revenue

In [23]:
%%sql
SELECT f.title, sum(p.amount) as revenue                                            
FROM payment p
JOIN rental r    ON ( p.rental_id = r.rental_id )
JOIN inventory i ON ( r.inventory_id = i.inventory_id )
JOIN film f ON ( i.film_id = f.film_id)
GROUP BY title
ORDER BY revenue desc
limit 10;

 * postgresql://postgres@127.0.0.1:5432/pagila
10 rows affected.

[('TELEGRAPH VOYAGE', Decimal('231.73')),
 ('WIFE TURN', Decimal('223.69')),
 ('ZORRO ARK', Decimal('214.69')),
 ('GOODFELLAS SALUTE', Decimal('209.69')),
 ('SATURDAY LAMBS', Decimal('204.72')),
 ('TITANS JERK', Decimal('201.71')),
 ('TORQUE BOUND', Decimal('198.72')),
 ('HARRY IDAHO', Decimal('195.70')),
 ('INNOCENT USUAL', Decimal('191.74')),
 ('HUSTLER PARTY', Decimal('190.78'))]

### Insight 2: Top grossing cities

Get the city of each payment

In [28]:
%%sql
SELECT p.customer_id, p.rental_id, p.amount, ci.city                            
FROM payment p
JOIN customer c  ON ( p.customer_id = c.customer_id )
JOIN address a ON ( c.address_id = a.address_id )
JOIN city ci ON ( a.city_id = ci.city_id )
order by p.payment_date
limit 10;

 * postgresql://postgres@127.0.0.1:5432/pagila
10 rows affected.

[(427, 8182, Decimal('3.99'), 'Guaruj'),
 (180, 2798, Decimal('2.99'), 'Pereira'),
 (426, 10172, Decimal('10.99'), 'Purnea (Purnia)'),
 (295, 2054, Decimal('2.99'), 'Kolpino'),
 (172, 1507, Decimal('0.99'), 'Batman'),
 (277, 6487, Decimal('5.99'), 'Ogbomosho'),
 (2, 8705, Decimal('5.99'), 'San Bernardino'),
 (108, 4082, Decimal('2.99'), 'Huixquilucan'),
 (141, 13470, Decimal('4.99'), 'Fukuyama'),
 (43, 8376, Decimal('4.99'), 'Faaa')]

Top grossing cities

In [33]:
%%sql
SELECT ci.city, sum(p.amount) as amount                           
FROM payment p
JOIN customer c  ON ( p.customer_id = c.customer_id )
JOIN address a ON ( c.address_id = a.address_id )
JOIN city ci ON ( a.city_id = ci.city_id )
group by ci.city
order by amount desc
limit 10;

 * postgresql://postgres@127.0.0.1:5432/pagila
10 rows affected.

[('Cape Coral', Decimal('221.55')),
 ('Saint-Denis', Decimal('216.54')),
 ('Aurora', Decimal('198.50')),
 ('Molodetno', Decimal('195.58')),
 ('Santa Brbara dOeste', Decimal('194.61')),
 ('Apeldoorn', Decimal('194.61')),
 ('Qomsheh', Decimal('186.62')),
 ('London', Decimal('180.52')),
 ('Ourense (Orense)', Decimal('177.60')),
 ('Bijapur', Decimal('175.61'))]

### Insight 3 : Revenue of a movie by customer city and by month

Total revenue by month

In [39]:
%%sql
SELECT sum(p.amount) as revenue, EXTRACT(month FROM p.payment_date) as month
from payment p
group by month
order by revenue desc
limit 10;

 * postgresql://postgres@127.0.0.1:5432/pagila
7 rows affected.

[(Decimal('11424.83'), Decimal('3')),
 (Decimal('11373.24'), Decimal('5')),
 (Decimal('10896.49'), Decimal('6')),
 (Decimal('10746.53'), Decimal('4')),
 (Decimal('10140.04'), Decimal('2')),
 (Decimal('9760.54'), Decimal('7')),
 (Decimal('3074.84'), Decimal('1'))]

Each movie by customer city and by month (data cube)

In [40]:
%%sql
SELECT f.title, p.amount, p.customer_id, ci.city, p.payment_date,EXTRACT(month FROM p.payment_date) as month
FROM payment p
JOIN rental r    ON ( p.rental_id = r.rental_id )
JOIN inventory i ON ( r.inventory_id = i.inventory_id )
JOIN film f ON ( i.film_id = f.film_id)
JOIN customer c  ON ( p.customer_id = c.customer_id )
JOIN address a ON ( c.address_id = a.address_id )
JOIN city ci ON ( a.city_id = ci.city_id )
order by p.payment_date
limit 10;

 * postgresql://postgres@127.0.0.1:5432/pagila
10 rows affected.

[('TOMORROW HUSTLER', Decimal('3.99'), 427, 'Guaruj', datetime.datetime(2022, 1, 23, 16, 3, 52, 212496, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), Decimal('1')),
 ('EXPRESS LONELY', Decimal('2.99'), 180, 'Pereira', datetime.datetime(2022, 1, 23, 16, 24, 17, 906429, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), Decimal('1')),
 ('MAIDEN HOME', Decimal('10.99'), 426, 'Purnea (Purnia)', datetime.datetime(2022, 1, 23, 16, 42, 35, 952907, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), Decimal('1')),
 ('GANDHI KWAI', Decimal('2.99'), 295, 'Kolpino', datetime.datetime(2022, 1, 23, 16, 43, 42, 505434, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), Decimal('1')),
 ('MAJESTIC FLOATS', Decimal('0.99'), 172, 'Batman', datetime.datetime(2022, 1, 23, 16, 57, 4, 87741, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), Decimal('1')),
 ('SWEDEN SHINING', Decimal('5.99'), 277, 'Ogbomosho', datetime.datetime(2022, 1, 23, 17, 5, 24, 118128, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), Decimal('1')),
 ('TELEGRAPH VOYAGE', Decimal('5.99'), 2, 'San Bernardino', datetime.datetime(2022, 1, 23, 17, 26, 35, 170413, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), Decimal('1')),
 ('OPERATION OPERATION', Decimal('2.99'), 108, 'Huixquilucan', datetime.datetime(2022, 1, 23, 17, 44, 27, 976362, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), Decimal('1')),
 ('PINOCCHIO SIMON', Decimal('4.99'), 141, 'Fukuyama', datetime.datetime(2022, 1, 23, 18, 6, 30, 830136, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), Decimal('1')),
 ('SHAWSHANK BUBBLE', Decimal('4.99'), 43, 'Faaa', datetime.datetime(2022, 1, 23, 18, 16, 12, 762605, tzinfo=datetime.timezone(datetime.timedelta(seconds=10800))), Decimal('1'))]

Sum of revenue of each movie by customer city and by month

In [48]:
%%sql
SELECT f.title, ci.city, EXTRACT(month FROM p.payment_date) as month, sum(p.amount) as revenue
FROM payment p
JOIN rental r    ON ( p.rental_id = r.rental_id )
JOIN inventory i ON ( r.inventory_id = i.inventory_id )
JOIN film f ON ( i.film_id = f.film_id)
JOIN customer c  ON ( p.customer_id = c.customer_id )
JOIN address a ON ( c.address_id = a.address_id )
JOIN city ci ON ( a.city_id = ci.city_id )
group by (f.title, ci.city, month)
order by month, revenue desc
limit 10;

 * postgresql://postgres@127.0.0.1:5432/pagila
10 rows affected.

[('BRIGHT ENCOUNTERS', 'Allende', Decimal('1'), Decimal('10.99')),
 ('MAIDEN HOME', 'Purnea (Purnia)', Decimal('1'), Decimal('10.99')),
 ('FLINTSTONES HAPPINESS', 'Baku', Decimal('1'), Decimal('10.99')),
 ('WONDERLAND CHRISTMAS', 'Hodeida', Decimal('1'), Decimal('10.99')),
 ('PATHS CONTROL', 'Yamuna Nagar', Decimal('1'), Decimal('10.99')),
 ('HALL CASSIDY', 'Bag', Decimal('1'), Decimal('9.99')),
 ('FLINTSTONES HAPPINESS', 'Kolpino', Decimal('1'), Decimal('9.99')),
 ('DESERT POSEIDON', 'Sawhaj', Decimal('1'), Decimal('9.99')),
 ('ELEPHANT TROJAN', 'al-Hawiya', Decimal('1'), Decimal('9.99')),
 ('GOODFELLAS SALUTE', 'Talavera', Decimal('1'), Decimal('9.99'))]